;Лабораторная работа №1
;Выполнил ст. гр. XXXXXXXX
;Программа 2 (DATA.ASM) Вариант №1
;============================================================
.486
.model flat, stdcall ;Устанавливается тип используемой модели памяти
option casemap: none
;============================================================
.stack 100h ;Определяется сегмент стека размером 256 байт
;============================================================
;Подключение необходимых модулей
include c:\masm32\include\windows.inc
include c:\masm32\include\user32.inc
include c:\masm32\include\kernel32.inc
includelib c:\masm32\lib\user32.lib
includelib c:\masm32\lib\kernel32.lib
;============================================================
.data ;Начало сегмента данных
A1 db 27 ;Определение однобайтовой переменной
A2 dw 0AE5h ;Определение двухбайтовой переменной (слова)
A3 dd 123456h ;Определение двойного слова (4 байта)
A4 db -2 ;Определение однобайтового числа со знаком
A5 dd A4 ;Определение четырехбайтового указателя на переменную A4
;============================================================
.code ;Начало сегмента кода
main: ;Метка, обозначающая точку входа в программу
mov bl, A1 ;Поместить в регистр BL значение переменной A1
mov bh, A4-2 ;Поместить в регистр BH байт памяти с адресом A4-2
mov ecx, offset A2 ;Поместить в регистр ECX адрес переменной A2
mov ax, A2 ;Поместить в регистр AX значение переменной A2
mov si, A2+1 ;Поместить в регистр SI слово памяти по адресу A2+1
invoke ExitProcess,0 ;Вызов функции завершения программы
end main ;Конец программы 
